---
kind: other
id: Methods.T:Autodesk.Revit.DB.ReferencePointArray
source: html/5edc2bad-7150-1f65-ff1f-85c68d41167b.htm
---
# ReferencePointArray Methods

Removes every reference from the array, rendering it empty.